# Property Setup Type Enumeration

Source: https://www.revitapidocs.com/2026/fc4081d2-462c-7571-c747-4d6fa3e57e77.htm

---

| Property Setup Type Enumeration |
| --- |

An enumerated type listing the types of property sets stored in the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum PropertySetupType
```

```
Public Enumeration PropertySetupType
```

```
public enum class PropertySetupType
```

```
type PropertySetupType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| IfcBaseQuantities | 2 | The base quantities. |
| IfcCommonPropertySets | 0 | The IFC common property sets. |
| RevitElementParameters | 1 | The Revit element parameters. |
| RevitMaterialParameters | 3 | The Revit material parameters. |
| RevitSchedules | 4 | The Revit schedules. |
| UserDefinedPropertySets | 5 | The user\-defined property sets. |

See Also

#### Reference

Autodesk.Revit.DB Namespace